In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
#to see unique values in a column either use len() or nunique()

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
len(df['col2'].unique())

3

In [5]:
df['col2'].nunique()

3

In [6]:
#to see how many times each uique value occured like a frequency table use the value count method

In [8]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [9]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [10]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [14]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [15]:
#to get dataframe, pass series in a square bracket and to use multiple conditions use square brackets outside and 
#each condtion in a round bracket inside with & or | in the middle

In [16]:
def times2(x):
    return x*2

In [17]:
times2(3)

6

In [21]:
df['col2'].sum()

2109

In [ ]:
#to use your own custom functions you must use the .apply() method

In [22]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [25]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [34]:
df['col2'].apply(lambda x: x*3)

0    1332
1    1665
2    1998
3    1332
Name: col2, dtype: int64

In [35]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [37]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [40]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [41]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [42]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [44]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [45]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [46]:
df.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [48]:
import numpy as np

In [49]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [50]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [51]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [52]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [56]:
df.pivot_table(values = 'D', columns=['A'] )

A       bar  foo
D  3.333333  2.0

In [57]:
df.pivot_table(values = 'D',index = ['A','B'], columns=['C'] )

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN